In [1]:
import os
import pymysql
import pandas as pd

In [2]:
import mysql.connector as sql

In [3]:
host = os.getenv('MYSQL_HOST')

In [4]:
database = os.getenv('MYSQL_DATABASE')
conn = pymysql.connect(
    host=host,
    port=int(3306),
    user="root",
    passwd="T#9542@naruto",
    db=database,
    charset='utf8mb4'
)

In [5]:
print(pd.read_sql_query('show databases',conn))

             Database
0              edyoda
1  information_schema
2               mysql
3  performance_schema
4                 sys
5             thirudb

In [8]:
cursor = conn.cursor()

In [9]:
query ="use edyoda"
cursor.execute(query)

0

In [10]:
print(pd.read_sql_query("show tables",conn))

  Tables_in_edyoda
0        customers
1           orders
2      salespeople

surcharge 

if ship_mode = "Same Day" then 20% or 0.2

else if ship_mode = "First Class" then 10% or 0.1

else if ship_mode = "Standard Class" then 5% or 0.5

else 0
total cost = (sales - profit ) * ( 1 + surcharge )

In [15]:
query ="create table sales_table(Sales INT,Profit INT,ship_mode varchar(20), Surcharge DECIMAL(10,3) GENERATED ALWAYS AS (CASE WHEN Ship_mode='Same Day' then 0.2 WHEN Ship_mode='First Class' then 0.1 WHEN Ship_mode='Standard Class' then 0.05 else 0 END),Total_cost DECIMAL(10,3) GENERATED ALWAYS AS((Sales-Profit)*(1+Surcharge)))"
cursor.execute(query)

0

In [16]:
print(pd.read_sql_query("show tables",conn))

  Tables_in_edyoda
0        customers
1           orders
2      sales_table
3      salespeople

In [17]:
print(pd.read_sql_query("select * from sales_table",conn))

Empty DataFrame
Columns: [Sales, Profit, ship_mode, Surcharge, Total_cost]
Index: []

In [18]:
query="insert into sales_table(Sales,Profit,ship_mode)values(2000,100,'Same Day'),(4000,250,'First Class'),(3500,150,'Standard Class'),(2600,170,''),(2700,70,'Standard Class')"
cursor.execute(query)

5

In [19]:
print(pd.read_sql_query("select * from sales_table",conn))

   Sales  Profit       ship_mode  Surcharge  Total_cost
0   2000     100        Same Day       0.20      2280.0
1   4000     250     First Class       0.10      4125.0
2   3500     150  Standard Class       0.05      3517.5
3   2600     170                       0.00      2430.0
4   2700      70  Standard Class       0.05      2761.5